levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timer4.h
/**
 *******************************************************************************
 * @file  hc32m423_timer4.h
 * @brief Head file for TIMER4 module.
 *
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-03       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */
#ifndef __HC32M423_TIMER4_H__
#define __HC32M423_TIMER4_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_TIMER4
 * @{
 */

#if (DDL_TIMER4_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TIMER4_Global_Types TIMER4 Global Types
 * @{
 */

/**
 * @brief Timer4 Counter(CNT) function initialization configuration
 */
typedef struct
{
    uint16_t u16CycleVal;       /*!< Timer4 count cycle value.
                                     This parameter can be a value of half-word */

    uint16_t u16CntMode;        /*!< Timer4 count mode.
                                     This parameter can be a value of @ref TIMER4_CNT_Mode */

    uint16_t u16ClkSrc;         /*!< Timer4 count clock source.
                                     This parameter can be a value of @ref TIMER4_CNT_Clock_Source */

    uint16_t u16ClkDiv;         /*!< Timer4 count clock division.
                                     This parameter can be a value of @ref TIMER4_CNT_Clock_Division */

    uint16_t u16ZeroIntMask;    /*!< Timer4 count zero interrupt mask times.
                                     This parameter can be a value of @ref TIMER4_CNT_Interrupt_Mask_Times */

    uint16_t u16PeakIntMask;    /*!< Timer4 count peak interrupt mask times.
                                     This parameter can be a value of @ref TIMER4_CNT_Interrupt_Mask_Times */

    en_functional_state_t enBufferCmd;  /*!< Timer4 count buffer state.
                                             This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enZeroIntCmd; /*!< Enable or disable zero match interrupt
                                             This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enPeakIntCmd; /*!< Enable or disable peak match interrupt
                                             This parameter can be a value of @ref en_functional_state_t */
} stc_timer4_cnt_init_t;

/**
 * @brief The configuration of OCO high channel OCMR field (OUH/OVH/OWH)
 */
typedef struct
{
    uint16_t OCFDCH : 1;    /*!< OCMRxh b0 High channel's OCF status when high channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFPKH : 1;    /*!< OCMRxh b1 High channel's OCF status when high channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFUCH : 1;    /*!< OCMRxh b2 High channel's OCF status when high channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFZRH : 1;    /*!< OCMRxh b3 High channel's OCF status when high channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint16_t OPDCH  : 2;    /*!< OCMRxh b5~b4 High channel's OP output status when high channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

