levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timer4.h
    uint16_t OPPKH  : 2;    /*!< OCMRxh b7~b6 High channel's OP output status when high channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPUCH  : 2;    /*!< OCMRxh b9~b8 High channel's OP output status when high channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPZRH  : 2;    /*!< OCMRxh b11~b10 High channel's OP output status when high channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPNPKH : 2;    /*!< OCMRxh b13~b12 High channel's OP output status when high channel match doesn't occur at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPNZRH : 2;    /*!< OCMRxh b15~b14 High channel's OP output status when high channel match doesn't occur at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */
} stc_timer4_oco_ocmrh_field_t;

/**
 * @brief The configuration of OCO high channel(OUH/OVH/OWH)
 */
typedef struct
{
    union
    {
        uint16_t OCMRx;

        stc_timer4_oco_ocmrh_field_t OCMRx_f;
    };

    en_functional_state_t enExtendMatchCondCmd; /*!< Extend the match condition
                                                     This parameter can be a value of @ref en_functional_state_t */
} stc_oco_high_ch_compare_mode_t;

/**
 * @brief The configuration of OCO low channel OCMR field (OUL/OVL/OWL)
 */
typedef struct
{
    uint32_t OCFDCL  : 1;   /*!< OCMRxl b0 Low channel's OCF status when low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFPKL  : 1;   /*!< OCMRxl b1 Low channel's OCF status when low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFUCL  : 1;   /*!< OCMRxl b2 Low channel's OCF status when low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFZRL  : 1;   /*!< OCMRxl b3 Low channel's OCF status when low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_OCF_State */

    uint32_t OPDCL   : 2;   /*!< OCMRxl b5~b4 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPPKL   : 2;   /*!< OCMRxl b7~b6 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPUCL   : 2;   /*!< OCMRxl b9~b8 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPZRL   : 2;   /*!< OCMRxl b11~b10 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPNPKL  : 2;   /*!< OCMRxl b13~b12 Low channel's OP output status when high channel not match and low channel not match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPNZRL  : 2;   /*!< OCMRxl b15~b14 Low channel's OP output status when high channel not match and low channel not match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNDCL : 2;   /*!< OCMRxl b17~b16 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT is coutning down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNUCL : 2;   /*!< OCMRxl b19~b18 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPDCL  : 2;   /*!< OCMRxl b21~b20 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPPKL  : 2;   /*!< OCMRxl b23~b22 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPUCL  : 2;   /*!< OCMRxl b25~b24 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPZRL  : 2;   /*!< OCMRxl b27~b26 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNPKL : 2;   /*!< OCMRxl b29~b28 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNZRL : 2;   /*!< OCMRxl b31~b30 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TIMER4_OCO_Cnt_Match_Output_Polarity */
} stc_timer4_oco_ocmrl_field_t;

/**
 ** \brief The configuration of OCO low channel(OUL/OVL/OWL)
 */
typedef struct
{
    union
    {
        uint32_t OCMRx;

        stc_timer4_oco_ocmrl_field_t OCMRx_f;
    };

    en_functional_state_t enExtendMatchCondCmd; /*!< Extend the match condition
                                                     This parameter can be a value of @ref en_functional_state_t */
} stc_oco_low_ch_compare_mode_t;

/**
 * @brief Timer4 Output Compare(OCO) initialization configuration
 */
typedef struct
{
    uint16_t u16OccrVal;        /*!< Timer4 OCO compare match value.
                                     This parameter can be a value of half-word */

    uint16_t u16OccrBufMode;                    /*!< Buffer register function of OCCR
                                                     This parameter can be a value of @ref TIMER4_OCO_OCCR_Buffer_Mode */

    en_functional_state_t enOccrLinkTransfer;   /*!< Enable or disable the OCCR buffer linked transfer with the CNT interrupt mask counter
                                                     This parameter can be a value of @ref en_functional_state_t */

    uint16_t u16OcmrBufMode;                    /*!< Buffer register function of OCMR
                                                     This parameter can be a value of @ref TIMER4_OCO_OCMR_Buffer_Mode */

    en_functional_state_t enOcmrLinkTransfer;   /*!< Enable or disable the OCMR buffer linked transfer with the CNT interrupt mask counter
                                                     This parameter can be a value of @ref en_functional_state_t */

    uint16_t u16OcoInvalidOp;                   /*!< Port output polarity when OCO is invalid
                                                     This parameter can be a value of @ref TIMER4_OCO_Invalid_Port_Output_Polarity */

    en_functional_state_t enOcoIntCmd;          /*!< Enable or disable OCO interrupt
                                                     This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enOcoCmd;             /*!< Enable or disable OCO function
                                                     This parameter can be a value of @ref en_functional_state_t */
} stc_timer4_oco_init_t;

/**
 * @brief Timer4 PWM initialization configuration
 */
typedef struct
{
    uint16_t u16Mode;                       /*!< Select PWM mode
                                                 This parameter can be a value of @ref TIMER4_PWM_Mode */

    uint16_t u16ClkDiv;                     /*!< Clock division of PWM timer
                                                 This parameter can be a value of @ref TIMER4_PWM_Clock_Division */

