levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timer4.h
/** @defgroup TIMER4_OCO_Channel TIMER4 OCO Channel
 * @{
 */
#define TIMER4_OCO_UH                           ((uint32_t)0UL)   /*!< Timer4 OCO channel:UH */
#define TIMER4_OCO_UL                           ((uint32_t)1UL)   /*!< Timer4 OCO channel:UL */
#define TIMER4_OCO_VH                           ((uint32_t)2UL)   /*!< Timer4 OCO channel:VH */
#define TIMER4_OCO_VL                           ((uint32_t)3UL)   /*!< Timer4 OCO channel:VL */
#define TIMER4_OCO_WH                           ((uint32_t)4UL)   /*!< Timer4 OCO channel:WH */
#define TIMER4_OCO_WL                           ((uint32_t)5UL)   /*!< Timer4 OCO channel:WL */
/**
 * @}
 */

/**
 * @defgroup TIMER4_OCO_Invalid_Port_Output_Polarity TIMER4 OCO Invalid Port Output Polarity
 * @note TIM4_<t>_OxH/TIM4_<t>_OxL: _<t>_ is unit number, t = 1, x = U/V/W
 * @{
 */
#define TIMER4_OCO_INVAILD_OP_LOW               ((uint16_t)0x0000U)             /*!< TIM4_<t>_OxH/TIM4_<t>_OxL output low level when OCO is invalid */
#define TIMER4_OCO_INVAILD_OP_HIGH              (!TIMER4_OCO_INVAILD_OP_LOW)    /*!< TIM4_<t>_OxH/TIM4_<t>_OxL output high level when OCO is invalid */
/**
 * @}
 */

/** @defgroup TIMER4_OCO_OCCR_Buffer_Mode TIMER4 OCO OCCR Buffer Mode
 * @{
 */
#define TIMER4_OCO_OCCR_BUF_DISABLE             ((uint16_t)0x0000U)                             /*!< Disable the register OCCR buffer function */
#define TIMER4_OCO_OCCR_BUF_CNT_ZERO            (TMR4_OCER_CHBUFEN_0 >> TMR4_OCER_CHBUFEN_POS)  /*!< Register OCCR buffer transfer when counter value is 0x0000 */
#define TIMER4_OCO_OCCR_BUF_CNT_PEAK            (TMR4_OCER_CHBUFEN_1 >> TMR4_OCER_CHBUFEN_POS)  /*!< Register OCCR buffer transfer when counter value is CPSR */
#define TIMER4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK    (TMR4_OCER_CHBUFEN >> TMR4_OCER_CHBUFEN_POS)    /*!< Register OCCR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TIMER4_OCO_OCMR_Buffer_Mode TIMER4 OCO OCMR Buffer Mode
 * @{
 */
#define TIMER4_OCO_OCMR_BUF_DISABLE             ((uint16_t)0x0000U)                                         /*!< Disable the register OCCR buffer function */
#define TIMER4_OCO_OCMR_BUF_CNT_ZERO            ((uint16_t)(TMR4_OCER_MHBUFEN_0 >> TMR4_OCER_MHBUFEN_POS))  /*!< Register OCMR buffer transfer when counter value is 0x0000 */
#define TIMER4_OCO_OCMR_BUF_CNT_PEAK            ((uint16_t)(TMR4_OCER_MHBUFEN_1 >> TMR4_OCER_MHBUFEN_POS))  /*!< Register OCMR buffer transfer when counter value is CPSR */
#define TIMER4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK    ((uint16_t)(TMR4_OCER_MHBUFEN >> TMR4_OCER_MHBUFEN_POS))    /*!< Register OCMR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TIMER4_OCO_Cnt_Match_OCF_State TIMER4 OCO Cnt Match OCF State
 * @{
 */
#define TIMER4_OCO_OCF_HOLD                     ((uint16_t)0x0000U)     /*!< Hold OCF */
#define TIMER4_OCO_OCF_SET                      (TMR4_OCMRH_OCFDCH)     /*!< Set OCF */
/**
 * @}
 */

/** @defgroup TIMER4_OCO_Cnt_Match_Output_Polarity TIMER4 OCO Cnt Match Output Polarity
 * @{
 */
#define TIMER4_OCO_OP_HOLD                      ((uint16_t)0x0000U)                           /*!< Hold output when the TIMER4 OCO count match */
#define TIMER4_OCO_OP_HIGH                      (TMR4_OCMRH_OPDCH_0 >> TMR4_OCMRH_OPDCH_POS)  /*!< Output high when the TIMER4 OCO count match */
#define TIMER4_OCO_OP_LOW                       (TMR4_OCMRH_OPDCH_0 >> TMR4_OCMRH_OPDCH_POS)  /*!< Output low when the TIMER4 OCO count match */
#define TIMER4_OCO_OP_INVERT                    (TMR4_OCMRH_OPDCH >> TMR4_OCMRH_OPDCH_POS)    /*!< Invert output when the TIMER4 OCO count match */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Macros TIMER4 PWM Macros
 * @{
 */

/** @defgroup TIMER4_PWM_Channel TIMER4 PWM Channel
 * @{
 */
#define TIMER4_PWM_U                            ((uint32_t)0U)   /*!< Timer4 PWM couple channel: U */
#define TIMER4_PWM_V                            ((uint32_t)1U)   /*!< Timer4 PWM couple channel: V */
#define TIMER4_PWM_W                            ((uint32_t)2U)   /*!< Timer4 PWM couple channel: W */
/**
 * @}
 */

/** @defgroup TIMER4_PWM_Port TIMER4 PWM Port
 * @{
 */
#define TIMER4_PWM_PORT_OUH                     ((uint32_t)0UL)   /*!< Timer4 PWM port: TIM4_<t>_OUH */
#define TIMER4_PWM_PORT_OUL                     ((uint32_t)1UL)   /*!< Timer4 PWM port: TIM4_<t>_OUL */
#define TIMER4_PWM_PORT_OVH                     ((uint32_t)2UL)   /*!< Timer4 PWM port: TIM4_<t>_OVH */
#define TIMER4_PWM_PORT_OVL                     ((uint32_t)3UL)   /*!< Timer4 PWM port: TIM4_<t>_OVL */
#define TIMER4_PWM_PORT_OWH                     ((uint32_t)4UL)   /*!< Timer4 PWM port: TIM4_<t>_OWH */
#define TIMER4_PWM_PORT_OWL                     ((uint32_t)5UL)   /*!< Timer4 PWM port: TIM4_<t>_OWL */
/**
 * @}
 */

/** @defgroup TIMER4_PWM_Clock_Division TIMER4 PWM Clock Division
 * @{
 */
#define TIMER4_PWM_CLK_DIV1                     ((uint16_t)0x0000U)     /*!< PCLK     */
#define TIMER4_PWM_CLK_DIV2                     (TMR4_POCR_DIVCK_0)     /*!< PCLK/2   */
#define TIMER4_PWM_CLK_DIV4                     (TMR4_POCR_DIVCK_1)     /*!< PCLK/4   */
#define TIMER4_PWM_CLK_DIV8                     (TMR4_POCR_DIVCK_1 | \
                                                 TMR4_POCR_DIVCK_0)     /*!< PCLK/8   */
#define TIMER4_PWM_CLK_DIV16                    (TMR4_POCR_DIVCK_2)     /*!< PCLK/16  */
#define TIMER4_PWM_CLK_DIV32                    (TMR4_POCR_DIVCK_2 | \
                                                 TMR4_POCR_DIVCK_0)     /*!< PCLK/32  */
#define TIMER4_PWM_CLK_DIV64                    (TMR4_POCR_DIVCK_2 | \
                                                 TMR4_POCR_DIVCK_1)     /*!< PCLK/64  */
#define TIMER4_PWM_CLK_DIV128                   (TMR4_POCR_DIVCK)       /*!< PCLK/128 */
/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Mode Timer4 PWM Mode
 * @{
 */
#define TIMER4_PWM_THROUGH_MODE                 ((uint16_t)0x0000U) /*!< Through mode */
#define TIMER4_PWM_DEAD_TIMER_MODE              (TMR4_POCR_PWMMD_0) /*!< Dead timer mode */
#define TIMER4_PWM_DEAD_TIMER_FILTER_MODE       (TMR4_POCR_PWMMD_1) /*!< Dead timer filter mode */
/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Output_Polarity Timer4 PWM Output Polarity
 * @{
 */
#define TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD         ((uint16_t)0x0000U) /*!< Output PWML and PWMH signals without changing the level */
#define TIMER4_PWM_OP_OXH_INVERT_OXL_INVERT     (TMR4_POCR_LVLS_0)  /*!< Output both PWML and PWMH signals reversed */
#define TIMER4_PWM_OP_OXH_INVERT_OXL_HOLD       (TMR4_POCR_LVLS_1)  /*!< Output the PWMH signal reversed, outputs the PWML signal without changing the level. */
#define TIMER4_PWM_OP_OXH_HOLD_OXL_INVERT       (TMR4_POCR_LVLS)    /*!< Output the PWMH signal without changing the level, Outputs the PWML signal reversed. */
/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Port_State Timer4 PWM Port State
 * @{
 */
#define TIMER4_PWM_PORT_OUTPUT_NORMAL           ((uint32_t)0UL)     /*!< TIM4_<t>_Oxy output normal */
#define TIMER4_PWM_PORT_OUTPUT_HIZ              (TMR4_PSCR_OSUH_0)  /*!< TIM4_<t>_Oxy output Hi-z */
#define TIMER4_PWM_PORT_OUTPUT_LOW              (TMR4_PSCR_OSUH_1)  /*!< TIM4_<t>_Oxy output low level */
#define TIMER4_PWM_PORT_OUTPUT_HIGH             (TMR4_PSCR_OSUH)    /*!< TIM4_<t>_Oxy output high level */
/**
 * @}
 */

/**
 * @defgroup TIMER4_PWM_Port_Enable_Bit_Effective_Time TIMER4 PWM Port Enable Bit Effective Time
 * @{
 */
#define TIMER4_PWM_PORT_ENBIT_EFFECT_IMMEDIATE  ((uint32_t)0UL)     /*!< TIMER4 PWM Port Enable Bit Effective Time: immediate */
#define TIMER4_PWM_PORT_ENBIT_EFFECT_CNTUVF     (TMR4_PSCR_ODT_1)   /*!< TIMER4 PWM Port Enable Bit Effective Time: Timer4 counter underflow */
#define TIMER4_PWM_PORT_ENBIT_EFFECT_CNTOVF     (TMR4_PSCR_ODT)     /*!< TIMER4 PWM Port Enable Bit Effective Time: Timer4 counter overflow */
 /**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TIMER4_SEVT_Macros TIMER4 Special Event Macros
 * @{
 */

/** @defgroup TIMER4_SEVT_Channel TIMER4 SEVT Channel
 * @{
 */
#define TIMER4_SEVT_UH                          ((uint32_t)0UL)   /*!< Timer4 SEVT channel:UH */
#define TIMER4_SEVT_UL                          ((uint32_t)1UL)   /*!< Timer4 SEVT channel:UL */
#define TIMER4_SEVT_VH                          ((uint32_t)2UL)   /*!< Timer4 SEVT channel:VH */
#define TIMER4_SEVT_VL                          ((uint32_t)3UL)   /*!< Timer4 SEVT channel:VL */
#define TIMER4_SEVT_WH                          ((uint32_t)4UL)   /*!< Timer4 SEVT channel:WH */
#define TIMER4_SEVT_WL                          ((uint32_t)5UL)   /*!< Timer4 SEVT channel:WL */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Buffer_Mode TIMER4 SEVT Buffer Mode
 * @{
 */
#define TIMER4_SEVT_BUF_DISABLE                 ((uint16_t)0x0000U) /*!< Disable the register SCCR&SCMR buffer function */
#define TIMER4_SEVT_BUF_CNT_ZERO                (TMR4_SCSR_BUFEN_0) /*!< Register SCCR&SCMR buffer transfer when counter value is 0x0000 */
#define TIMER4_SEVT_BUF_CNT_PEAK                (TMR4_SCSR_BUFEN_1) /*!< Register SCCR&SCMR buffer transfer when counter value is CPSR */
#define TIMER4_SEVT_BUF_CNT_ZERO_OR_PEAK        (TMR4_SCSR_BUFEN)   /*!< Register SCCR&SCMR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Trigger_Event TIMER4 SEVT Trigger Event
 * @{
 */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMUH          ((uint16_t)0x0000U)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMUH */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMUL          (TMR4_SCSR_EVTOS_0)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMUL */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMVH          (TMR4_SCSR_EVTOS_1)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMVH */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMVL          (TMR4_SCSR_EVTOS_1 | \
                                                 TMR4_SCSR_EVTOS_0)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMVL */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMWH          (TMR4_SCSR_EVTOS_2)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMWH */
#define TIMER4_SEVT_TRIGGER_TMR4_SCMWL          (TMR4_SCSR_EVTOS_2 | \
                                                 TMR4_SCSR_EVTOS_0)     /*!< Timer4 Special-EVT trigger event: TMR4_SCMWL */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Mode TIMER4 SEVT Mode
 * @{
 */
#define TIMER4_SEVT_MODE_COMPARE_TRIGGER        ((uint16_t)0x0000U) /*!< TIMER4 SEVT mode: OCCRxh */
#define TIMER4_SEVT_MODE_DELAY_TRIGGER          (TMR4_SCSR_EVTMS)   /*!< TIMER4 SEVT mode: OCCRxl */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Delay_Object TIMER4 SEVT Delay Object
 * @{
 */
#define TIMER4_SEVT_DELAY_OCCRXH                ((uint16_t)0x0000U) /*!< TIMER4 SEVT delay object: OCCRxh */
#define TIMER4_SEVT_DELAY_OCCRXL                (TMR4_SCSR_EVTDS)   /*!< TIMER4 SEVT delay object: OCCRxl */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Mask_Times TIMER4 SEVT Mask Times
 * @{
 */
#define TIMER4_SEVT_MASK_0                      ((uint16_t)0x0000U)     /*!< Mask 0 time */
#define TIMER4_SEVT_MASK_1                      (TMR4_SCMR_AMC_0)       /*!< Mask 1 times */
#define TIMER4_SEVT_MASK_2                      (TMR4_SCMR_AMC_1)       /*!< Mask 2 times */
#define TIMER4_SEVT_MASK_3                      (TMR4_SCMR_AMC_1 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 3 times */
#define TIMER4_SEVT_MASK_4                      (TMR4_SCMR_AMC_2)       /*!< Mask 4 times */
#define TIMER4_SEVT_MASK_5                      (TMR4_SCMR_AMC_2 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 5 times */
#define TIMER4_SEVT_MASK_6                      (TMR4_SCMR_AMC_2 | \
                                                 TMR4_SCMR_AMC_1)       /*!< Mask 6 times */
#define TIMER4_SEVT_MASK_7                      (TMR4_SCMR_AMC_2 | \
                                                 TMR4_SCMR_AMC_1 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 7 times */
#define TIMER4_SEVT_MASK_8                      (TMR4_SCMR_AMC_3)       /*!< Mask 8 times */
#define TIMER4_SEVT_MASK_9                      (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 9 times */
#define TIMER4_SEVT_MASK_10                     (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_1)       /*!< Mask 10 times */
#define TIMER4_SEVT_MASK_11                     (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_1 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 11 times */
#define TIMER4_SEVT_MASK_12                     (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_2)       /*!< Mask 12 times */
#define TIMER4_SEVT_MASK_13                     (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_2 | \
                                                 TMR4_SCMR_AMC_0)       /*!< Mask 13 times */
#define TIMER4_SEVT_MASK_14                     (TMR4_SCMR_AMC_3 | \
                                                 TMR4_SCMR_AMC_2 | \
                                                 TMR4_SCMR_AMC_1)       /*!< Mask 14 times */
#define TIMER4_SEVT_MASK_15                     (TMR4_SCMR_AMC)         /*!< Mask 15 times */
/**
 * @}
 */

/** @defgroup TIMER4_SEVT_Event_Signal_Output TIMER4 SEVT Event Signal Output
 * @{
 */
#define TIMER4_SEVT_EVTSIGx_OUTPUT_DISABLE      ((uint16_t)0x0000U)     /*!< Disable output event signal of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG0_OUTPUT              (TMR4_SCER_EVTRS_0 )    /*!< Output the specified event signal 0 of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG1_OUTPUT              (TMR4_SCER_EVTRS_1)     /*!< Output the specified event signal 1 of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG2_OUTPUT              (TMR4_SCER_EVTRS_1 | \
                                                 TMR4_SCER_EVTRS_0)     /*!< Output the specified event signal 2 of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG3_OUTPUT              (TMR4_SCER_EVTRS_2)     /*!< Output the specified event signal 3 of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG4_OUTPUT              (TMR4_SCER_EVTRS_2 | \
                                                 TMR4_SCER_EVTRS_0)     /*!< Output the specified event signal 4 of Timer4 Special-EVT */
#define TIMER4_SEVT_EVTSIG5_OUTPUT              (TMR4_SCER_EVTRS_2 | \
                                                 TMR4_SCER_EVTRS_1)     /*!< Output the specified event signal 5 of Timer4 Special-EVT */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

